Documents/УдалитьЗаменыРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УдалитьЗаменыРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьСведенияОЗаменахВОрганизации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУпрУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗанимаемыхСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТабельныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УдалитьЗаменыРаботниковОрганизаций/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаменыРаботниковОрганизаций.Дата,
	|	ЗаменыРаботниковОрганизаций.Организация,
	|	ВЫБОР КОГДА ЗаменыРаботниковОрганизаций.Организация.ГоловнаяОрганизация = &ПустаяОрганизация ТОГДА ЗаменыРаботниковОрганизаций.Организация ИНАЧЕ ЗаменыРаботниковОрганизаций.Организация.ГоловнаяОрганизация КОНЕЦ КАК ГоловнаяОрганизация,
	|	ЗаменыРаботниковОрганизаций.Ссылка
	|ИЗ
	|	Документ.ЗаменыРаботниковОрганизаций КАК ЗаменыРаботниковОрганизаций
	|
	|ГДЕ
	|	ЗаменыРаботниковОрганизаций.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоРаботникиОрганизации(Режим)

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);

	ТекстЗапроса = "ВЫБРАТЬ                                                          
	               |	ТЧЗамены.ЗанимаемыхСтавок          	КАК ЗанимаемыхСтавок,
	               |	ТЧЗамены.ВидРасчета               	КАК ВидРасчета,
	               |	ТЧЗамены.НомерСтроки               	КАК НомерСтроки,
				   |	ТЧЗамены.ДатаНачала                	КАК ДатаНачала,
	               |	ТЧЗамены.ДатаОкончания             	КАК ДатаОкончания,
				   |
	               |	ТЧЗамены.ФизЛицо                   	КАК ФизЛицо,
	               |	ТЧЗамены.Приказ                    	КАК Приказ,
				   |
				   |    // кого замещал, все тоже самое для работников которые замещали
				   |	ТЧЗамены.ЗаменаФизЛицо  	                 		КАК ЗаменаФизЛицо,
				   |	ТЧЗамены.ЗаменаПриказ	                    		КАК ЗаменаПриказ,
				   |
				   |	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер				КАК КонфликтнаяСтрокаНомер
	               |
	               |ИЗ Документ.ЗаменыРаботниковОрганизаций.Замены КАК ТЧЗамены
				   |		
				   |		
				   |// --- конфликтная строка ---
				   |ЛЕВОЕ СОЕДИНЕНИЕ (
				   |    ВЫБРАТЬ
				   |		ТЧЗамены1.НомерСтроки           КАК НомерСтроки,
				   |		ТЧЗамены1.ФизЛицо               КАК ФизЛицо,
				   |		ТЧЗамены1.Приказ                КАК Приказ,
				   |		ТЧЗамены1.ЗаменаФизЛицо         КАК ЗаменаФизЛицо,
				   |		ТЧЗамены1.ЗаменаПриказ          КАК ЗаменаПриказ,
				   |		ТЧЗамены1.ДатаНачала            КАК ДатаНачала,
				   |		ТЧЗамены1.ДатаОкончания         КАК ДатаОкончания,
				   |		МИНИМУМ(ТЧЗамены2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
				   |			
				   |		ИЗ Документ.ЗаменыРаботниковОрганизаций.Замены КАК ТЧЗамены1
				   |			
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаменыРаботниковОрганизаций.Замены КАК ТЧЗамены2
				   |		ПО (ТЧЗамены2.Ссылка = &ДокументСсылка) 
				   |		   И ТЧЗамены1.ФизЛицо = ТЧЗамены2.ФизЛицо 
				   |		   И ТЧЗамены1.Приказ = ТЧЗамены2.Приказ 
				   |		   И ТЧЗамены1.ЗаменаФизЛицо = ТЧЗамены2.ЗаменаФизЛицо 
				   |		   И ТЧЗамены1.ЗаменаПриказ = ТЧЗамены2.ЗаменаПриказ 
				   |		   И ТЧЗамены1.НомерСтроки <> ТЧЗамены2.НомерСтроки 
				   |		   И ТЧЗамены1.ДатаНачала <= ТЧЗамены2.ДатаОкончания 
				   |		   И ТЧЗамены2.ДатаНачала <= ТЧЗамены1.ДатаОкончания 
				   |		
				   |	ГДЕ ТЧЗамены1.Ссылка = &ДокументСсылка
				   |		
				   |	СГРУППИРОВАТЬ ПО
				   |		ТЧЗамены1.НомерСтроки,
				   |		ТЧЗамены1.ФизЛицо,
				   |		ТЧЗамены1.Приказ,
				   |		ТЧЗамены1.ЗаменаФизЛицо,
				   |		ТЧЗамены1.ЗаменаПриказ,
				   |		ТЧЗамены1.ДатаНачала,
				   |		ТЧЗамены1.ДатаОкончания
				   |) КАК ПересекающиесяСтроки
				   |ПО ТЧЗамены.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
	               |
	               |ГДЕ	ТЧЗамены.Ссылка = &ДокументСсылка
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	НомерСтроки
				   |";

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация!", Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоСтрокамДокумента, Отказ)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники"": ";
	
	// --- общие параметры
	// ДатаНачала
	НетДатыНачала = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала);
	Если НетДатыНачала Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указазана дата начала замещения!", Отказ);
	КонецЕсли;
	
	// ДатаОкончания
	НетДатыОкончания = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания);
	Если НетДатыОкончания Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указазана дата окнчания замещения!", Отказ);
	КонецЕсли;
	
	// ДатаОкончания
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) и ВыборкаПоСтрокамДокумента.ДатаНачала > ВыборкаПоСтрокамДокумента.ДатаОкончания Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "дата начала перемещения не может превышать дату окончания!", Отказ);
	КонецЕсли;
	
	// Количество ставок
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано количество занимаемых работником ставок!", Отказ);
	КонецЕсли;
	
	// Вид замены
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указан вид замены (замещение / совмещение)!", Отказ);
	КонецЕсли;
	
	
	// --- КТО заменял
	// ФизЛицо
	НетФизЛица = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо);
	Если НетФизЛица Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ);
	КонецЕсли;
	
	
	// Приказ
	НетПриказа = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Приказ);
	Если НетПриказа Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задан приказ о приеме на работу!", Отказ);
	КонецЕсли;
	
	Если НетФизЛица ИЛИ НетДатыНачала ИЛИ НетПриказа Тогда
		Возврат; // Дальше не проверяем
	КонецЕсли;	
	
	// --- КОГО заменяли
	// ФизЛицо
	НетФизЛица = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ЗаменаФизЛицо);
	Если НетФизЛица Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбран работник которого заменяли!", Отказ);
	КонецЕсли;
	
	// Приказ
	НетПриказа = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ЗаменаПриказ);
	Если НетПриказа Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задан приказ (замены) о приеме на работу!", Отказ);
	КонецЕсли;
	
	Если НетФизЛица ИЛИ НетДатыНачала ИЛИ НетПриказа Тогда
		Возврат; // Дальше не проверяем
	КонецЕсли;	
	
	// --- общие параметры
	// Проверка: противоречие другой строке документа
	Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
		СтрокаСообщениеОбОшибке = "период действия назначения пересекается с периодом действия строки " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + "!"; 
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента,    ВыборкаПоСтрокамДокумента)
	
	ИмяРегистра = "СведенияОЗаменахВОрганизации";
	// ---
	// отразим новое место работы (движение 1)
	Движение = Движения[ИмяРегистра].Добавить();
	// Свойства
	Движение.Период                     = ВыборкаПоСтрокамДокумента.ДатаНачала;
	// Измерения
	Движение.Организация                = ВыборкаПоШапкеДокумента.Организация;
	Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Приказ                    	= ВыборкаПоСтрокамДокумента.Приказ;
	Движение.ЗаменаФизЛицо		        = ВыборкаПоСтрокамДокумента.ЗаменаФизЛицо;
	Движение.ЗаменаПриказ				= ВыборкаПоСтрокамДокумента.ЗаменаПриказ;
	Движение.ВидРасчета                 = ВыборкаПоСтрокамДокумента.ВидРасчета;
	// Ресурсы
	Движение.КоличествоСтавок	        = ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок;
	
	
	// --- ---
	// отразим новое место работы (движение 2)
	Движение = Движения[ИмяРегистра].Добавить();
	// Свойства
	Движение.Период             = КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания);
	// Измерения
	Движение.Организация        = ВыборкаПоШапкеДокумента.Организация;
	Движение.ФизЛицо            = ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Приказ            	= ВыборкаПоСтрокамДокумента.Приказ;
	Движение.ЗаменаФизЛицо      = ВыборкаПоСтрокамДокумента.ЗаменаФизЛицо;
	Движение.ЗаменаПриказ       = ВыборкаПоСтрокамДокумента.ЗаменаПриказ;
	Движение.ВидРасчета         = ВыборкаПоСтрокамДокумента.ВидРасчета;
	// Ресурсы
	Движение.КоличествоСтавок	= 0;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)

	Отказ = Истина;
	Возврат;
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда

			// получим реквизиты табличной части
			РезультатЗапросаПоРаботники	= 	СформироватьЗапросПоРаботникиОрганизации(Режим);
			ВыборкаПоСтрокамДокумента	= 	РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоСтрокамДокумента, Отказ);
				Если НЕ Отказ Тогда

					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);

				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
